rails/app/controllers/articles_controller.rb

  def show
    # @article is an instance variable, and by default, Rails passes all instance variables to the view
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    # By default, the parameters will be the fields of the form defined in articles/new.html.erb
    # Parameters: {"authenticity_token"=>"[FILTERED]", "article"=>{"title"=>"", "text"=>""}, "commit"=>"Save Article"}
    # render plain: params[:article].inspect

    # The class Article is defined in the model.
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hi"], ["body", "Woah this is cool."], ["created_at", "2023-04-13 00:24:57.119354"], ["updated_at", "2023-04-13 00:24:57.119354"]]